[{"author":null,"categories":["Reading Writing"],"content":"《鼠疫》是加缪写在一九四几年写的小说，讲述了一座小城市突然被鼠疫这个病入侵，封城后人们一系列的举动。\n鼠疫带来的不仅仅是病痛和死亡，还有对于在平庸的小镇过着平庸的生活的人们翻天覆地的变化。鼠疫的到来是荒谬的，疫情从简简单单一只死去的老鼠逐渐演变成了要封城的地步，人们离奇死亡；鼠疫的离开更是荒谬的，它看似随着时间的流逝消失的无影无踪；有些人幸运的从病痛中恢复了，有些人却为此付出了生命的代价。人们平庸的生活却被这一事件打破，在面对如此近距离的死亡后，他们逐渐开始思考生命的意义，开始思考如何面对“荒谬”。\n每个人物在面对此次疫情中的态度各不相同。帕纳鲁神父在最开始面对鼠疫时宣称人们‘罪有应得’，这是上帝给堕落的人们带来的惩罚，但在看到一个无辜的小孩饱受病痛的折磨并死去后，他的内心发生了极大的震撼。上帝是仁慈的，却眼睁睁的看着小孩逝去；这时他才面对了荒谬——世界并不会理会渺小的个体，在面对无数次呐喊仍默不作声。他对自己的信仰产生了极大的动摇，却仍坚定信念（如同克尔郭凯尔的信仰之跃）最终在这种状态下离奇死亡。\n在面对鼠疫时，里厄医生和众多志愿者积极抗争。虽然里厄医生知道他的做法对解决这次灾难没有什么用，他却坚持救治。这于加缪所倡导面对荒谬的方式相似，让我想起了西西弗斯。在做的一切，整个世界都是荒谬的，但在荒谬之下，每个人的态度又不同。里厄医生与西西弗斯选择反抗，他们知道自己努力救治或将石头推上山后的最终结局是失败，但奋斗中（去救治，将石头推上山）的这种拼搏足以充实他们的内心，拾起对生活的希望。\n鼠疫像是加缪给世人们的一种启示。生命中充满了变化和偶然，但面对这种事件并不容易，可能会导致人们思考生活，质问生命的意义。当所有人发现生命无意义，面对的一切是荒谬后，又该如何反应？会崩溃还是会选择将信念寄托于飘渺，是会奋起反抗还是会丧失对生活的热爱？加缪在书中似乎给了人们一种借鉴方式，就是虽知道做的一切事情没有意义却仍然奋不顾身的去做，在拼搏的过程中感受到‘意义’，充足内心。在这种情况下，人们应当想象他们是幸福的。\n","date":1756080000,"dir":"post\\鼠疫\\","expirydate":-62135596800,"fuzzywordcount":900,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1756080000,"objectID":"5313f345a3996b60bb333706762d5ff1","permalink":"https://mlswebsite.github.io/post/%E9%BC%A0%E7%96%AB/","publishdate":"2025-08-25T00:00:00Z","readingtime":2,"relpermalink":"/post/%E9%BC%A0%E7%96%AB/","section":"post","tags":["Book Review"],"title":"鼠疫 （The Plague）","type":"post","url":"/post/%E9%BC%A0%E7%96%AB/","weight":0,"wordcount":857},{"author":null,"categories":["Reading Writing"],"content":"She is highly sympathetic yet also disturbingly unhinged. She’s trapped in a suffocating environment after the first world war, burdened with caring for her paralyzed father and living under her mother’s strict authority. Yet she dreams to be a star- a dancer that will one day famous, like such in the Hollywood movies. At the beginning of the film, Pearl admires herself in the mirror. She believes that the image in the mirror (her ideal self) is the sweet, glamorous movie star (yet the role is acutally shaped by the American Dream). It kinda feels like ‘the mirror stage’ Lacan mentioned. During this stage, infants recognize themselves in the mirror. The reflected self appears whole and unified, but the actual self is fragmented and uncoordinated. From this gap, the infant constructs an ‘ideal ego,’ a seemingly complete and coherent self-image. Pearl believes that herself in the mirror is a star, yet it is found on misrecognition, as Pearl can never become the cinematic ideal she …","date":1755993600,"dir":"post\\pearl\\","expirydate":-62135596800,"fuzzywordcount":800,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1755993600,"objectID":"36525668db98c55439c5935fec21b715","permalink":"https://mlswebsite.github.io/post/pearl/","publishdate":"2025-08-24T00:00:00Z","readingtime":4,"relpermalink":"/post/pearl/","section":"post","tags":["Film Review"],"title":"Pearl (Movie) Analysis","type":"post","url":"/post/pearl/","weight":0,"wordcount":714},{"author":null,"categories":["Reading Writing"],"content":"WORK IN PROGRESS\n","date":1754352000,"dir":"post\\Dreams\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1754352000,"objectID":"cff6c29b10f3a67247b21d7997af0a14","permalink":"https://mlswebsite.github.io/post/dreams/","publishdate":"2025-08-05T00:00:00Z","readingtime":1,"relpermalink":"/post/dreams/","section":"post","tags":["Writings"],"title":"The Dream","type":"post","url":"/post/dreams/","weight":0,"wordcount":3},{"author":null,"categories":["Academics"],"content":" Dominique Francon loves Roark, yet she struggles to destroy his career. Why? What does she come to understand over the course of the novel that ultimately convinces her to change her mind? How does this conflict of hers relate to the novel’s theme and meaning? In your answer, refer to both The Fountainhead and “Introduction to the Twenty-fifth Anniversary Edition” of The Fountainhead.\nDominique is a conflicted character that pursues her idealism yet is confined to the world by her pessimism. She loves Roark, because he embodies everything she values: greatness, purity, desire, and freedom from social constraints. Dominique admires his greatness, although it is for the same reason that she attempts to destroy his career. She believes that greatness is doomed to fail, to be corrupted by the mediocre, so that’s why she destroys his career.\nHer destruction of Roark’s career cannot be considered as betrayal or conflict- it is protection. She destroys his career for a similar reason she …","date":1753920000,"dir":"post\\essay-3\\","expirydate":-62135596800,"fuzzywordcount":1200,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1753920000,"objectID":"708f267d2ba46907bf8a1781901ea867","permalink":"https://mlswebsite.github.io/post/essay-3/","publishdate":"2025-07-31T00:00:00Z","readingtime":6,"relpermalink":"/post/essay-3/","section":"post","tags":["ayn rand competition"],"title":"The Fountianhead- Q3","type":"post","url":"/post/essay-3/","weight":0,"wordcount":1109},{"author":null,"categories":["Reading Writing"],"content":"WORK IN PROGRESS\nOctober 1st\nIt’s been five months since she died. People still look at me as if I’m some question they’re too polite to ask. I sit quiet during the funeral, my black shirt swaying with the wind. The wind blows; it howls, seemingly mourning for my encounter. Besides the wind, everything else was still. Guests shuffled around me, phrases of ‘everything happens for a reason’, ‘it’s a miracle you were spared’ ‘you have to move on’ passed into my ear. They were like droplets of rain, fragile, empty, and disappeared quickly. One ear in, out the other. I guess everyone wanted me to believe that her death was a comma in some divine sentence, which I thought it wasn’t. It felt like a typo one made and didn’t care to change. I met our parents. I see my mother dabbing her tears onto her handkerchief as if she could press them away. I saw my father lowering his head. I guess he didn’t want guests to see him crying. I sat beside them during the funeral. No words were exchanged. I …","date":1753833600,"dir":"post\\Grief\\","expirydate":-62135596800,"fuzzywordcount":2500,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1753833600,"objectID":"9b74361b1926266b218357faa2f8670c","permalink":"https://mlswebsite.github.io/post/grief/","publishdate":"2025-07-30T00:00:00Z","readingtime":12,"relpermalink":"/post/grief/","section":"post","tags":["Writings"],"title":"Journal One","type":"post","url":"/post/grief/","weight":0,"wordcount":2489},{"author":null,"categories":["Academics"],"content":"Introduction to the Twenty-fifth Anniversary Edition Many people have asked me how I feel about the fact that The Fountainhead has been in print for twenty-five years. I cannot say that I feel anything in particular, except a kind of quiet satisfaction. In this respect, my attitude toward my writing is best expressed by a statement of Victor Hugo: \u0026amp;ldquo;If a writer wrote merely for his time, I would have to break my pen and throw it away.\u0026amp;rdquo;\nCertain writers, of whom I am one, do not live, think or write on the range of the moment. Novels, in the proper sense of the word, are not written to vanish in a month or a year. That most of them do, today, that they are written and published as if they were magazines, to fade as rapidly, is one of the sorriest aspects of today\u0026amp;rsquo;s literature, and one of the clearest indictments of its dominant esthetic philosophy: concrete-bound, journalistic Naturalism which has now reached its dead end in the inarticulate sounds of panic. …","date":1753401600,"dir":"post\\essay-2\\","expirydate":-62135596800,"fuzzywordcount":3400,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1753401600,"objectID":"f25db46d0bdba03c26783e5ff72942b0","permalink":"https://mlswebsite.github.io/post/essay-2/","publishdate":"2025-07-25T00:00:00Z","readingtime":16,"relpermalink":"/post/essay-2/","section":"post","tags":["ayn rand competition"],"title":"The Fountianhead- Q2","type":"post","url":"/post/essay-2/","weight":0,"wordcount":3395},{"author":null,"categories":["Academics"],"content":" “He rose, beamed and held Dominique\u0026amp;rsquo;s hand. “Thought I\u0026amp;rsquo;d drop in on my way home,” he said. “I\u0026amp;rsquo;ve got something to tell you. How did it go, kid?”\n“As I expected it.”\nShe tore her hat off and threw it down on the first chair in sight. Her hair slanted in a flat curve across her forehead and fell in a straight line to her shoulders; it looked smooth and tight, like a bathing cap of pale, polished metal. She walked to the window and stood looking out over the city. She asked without turning: “What did you want to tell me?”\nAlvah Scarret watched her pleasurably. He had long since given up any attempts beyond holding her hand when not necessary or patting her shoulder; he had stopped thinking of the subject, but he had a dim, half-conscious feeling which he summed up to himself in the words: You never can tell.\n“I\u0026amp;rsquo;ve got good news for you, child,” he said. “I\u0026amp;rsquo;ve been working out a little scheme, just a bit of reorganization, and I\u0026amp;rsquo;ve figured where …","date":1753142400,"dir":"post\\essay-1\\","expirydate":-62135596800,"fuzzywordcount":2300,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1753142400,"objectID":"701b03b207fd1a03a77bd028f4fbee09","permalink":"https://mlswebsite.github.io/post/essay-1/","publishdate":"2025-07-22T00:00:00Z","readingtime":11,"relpermalink":"/post/essay-1/","section":"post","tags":["ayn rand competition"],"title":"The Fountianhead- Q1","type":"post","url":"/post/essay-1/","weight":0,"wordcount":2263},{"author":null,"categories":["Reading Writing"],"content":"我是一个看完影片就喜欢刷评论的人 。在看完《好想做一次》全四季后，我兴高采烈的去不同网站上翻评论和看点评去了。令我诧异的是，Devi（主角）这个角色的行为/性格包含争议：有些人很喜欢她，又有些人很讨厌她。\n这部剧讲述了一位印度裔美国少女Devi在加州的成长故事。她聪明、冲动、情绪丰富，也总是把生活搞得一团糟。这就是主角Devi，一个常常处于崩溃边缘的女孩。\n故事从她父亲突然去世的创伤开始，Devi决定在新学年“重塑自己”，走红校园。她的对策是让她和她的朋友Fabiola, Eleanor谈一场校园恋爱。 而在她试图开启恋爱关系时，两个截然不同的男生闯进了她的生活：Paxton，学校里最受欢迎的帅哥，和Ben，她一直以来成绩优异的死对头。\n这部剧节奏快，情绪真。每个角色都在成长，试图找到自己，经常搞砸其他人的生活。尤其是Devi：她在愤怒中伤害朋友、在情绪里做错决定，每天想的都是恋爱以及男生；但她也在不断后悔、试着修补的过程中，一点一点地长大。\n有些人喜欢她的坦诚，自信；却又有很多人骂她自私自利，网上是否能容忍她做出的行为争议不断。我很喜欢Devi，我欣赏她的坦诚，勇敢与自信。我佩服她在犯下一连串错误后，仍敢承担后果、不觉得羞耻。（如果换作是我，可能早就想逃离地球了谢谢。）我能理解其他人为什么讨厌她：我也不能理解他为什么要因为她喜欢的男生跟Margo大吵一架，也不能理解为什么为了帮她喜欢的男生而抛弃下她处于崩溃边缘的最好的朋友，更不能理解为什么她传播Aneesa 的谣言后想的去道歉的原因是为了让她喜欢的男的回转心意。她的做法并不值得鼓励，甚至违背了我们普遍认同的道德标准。\n我并不会为她开脱，但我认为她犯的错误是合理的。她正处于失去父亲的悲痛中和青春期，更何况，这部剧的题材就是成长（Coming of Age story），所以在成长前她必须要犯错，因为只有犯下错误，才从中反思才能成长。 Coming of age story 应该是什么样子的呢？对于这个的解释，谷歌说“Coming of age deals with the process of transitioning from childhood to adulthood. Stories in this genre typically follow a young protagonist\u0026amp;rsquo;s …","date":1752192000,"dir":"post\\never-have-i-ever\\","expirydate":-62135596800,"fuzzywordcount":1300,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1752192000,"objectID":"ca3257c1fcef5c04f7ed1619e2d0b357","permalink":"https://mlswebsite.github.io/post/never-have-i-ever/","publishdate":"2025-07-11T00:00:00Z","readingtime":3,"relpermalink":"/post/never-have-i-ever/","section":"post","tags":["Film Review"],"title":"致最真实的女主：写在看完《好想做一次》之后 (Never Have I Ever)","type":"post","url":"/post/never-have-i-ever/","weight":0,"wordcount":1260},{"author":null,"categories":["research"],"content":"WORK IN PROGRESS\n","date":1752105600,"dir":"post\\Loss Aversion \u0026 Academic Performance\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1752105600,"objectID":"a152d9725728c2fdbbde4b1a2d59bed0","permalink":"https://mlswebsite.github.io/post/loss-aversion--academic-performance/","publishdate":"2025-07-10T00:00:00Z","readingtime":1,"relpermalink":"/post/loss-aversion--academic-performance/","section":"post","tags":["behavioral economics"],"title":"The relationship between Loss Aversion Preferences and Academic Performance","type":"post","url":"/post/loss-aversion--academic-performance/","weight":0,"wordcount":3},{"author":null,"categories":["research"],"content":"摘要 This paper analyzes the evolving relationship between Evelyn and her daughter Joy in Everything Everywhere All at Once. We seek to answer the following question: Why does the relationship between Evelyn and her daughter undergo such a dramatic transformation? The study analyzes such question through the theoretical lenses of structuralism and Hegelian dialectics, ultimately concluding that the root of the mother-daughter conflict lies in the failure of the Symbolic Order to fully symbolize the Real. Specifically, when facing the collapse of the symbolic order, Evelyn\u0026amp;rsquo;s initial coping strategy - relying on \u0026amp;lsquo;fantasy\u0026amp;rsquo; and \u0026amp;lsquo;adding signifiers that slips along the signifying chain\u0026amp;rsquo; to suppress surplus - inevitably produces more surplus, as symbolization always generates new remnants. The excessive use of symbolization leads to the \u0026amp;ldquo;death\u0026amp;rdquo; of the subject. Evelyn’s resolution comes not through violently repressing surplus (her daughter’s loss of …","date":1750723200,"dir":"post\\瞬息全宇宙\\","expirydate":-62135596800,"fuzzywordcount":9300,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1750723200,"objectID":"286b1004b92bd72d824e8c04aefa6cbd","permalink":"https://mlswebsite.github.io/post/%E7%9E%AC%E6%81%AF%E5%85%A8%E5%AE%87%E5%AE%99/","publishdate":"2025-06-24T00:00:00Z","readingtime":19,"relpermalink":"/post/%E7%9E%AC%E6%81%AF%E5%85%A8%E5%AE%87%E5%AE%99/","section":"post","tags":["psychology","philosophy"],"title":"《瞬息全宇宙》中母女关系的变化——从结构主义到辩证法","type":"post","url":"/post/%E7%9E%AC%E6%81%AF%E5%85%A8%E5%AE%87%E5%AE%99/","weight":0,"wordcount":9239},{"author":null,"categories":["Reading Writing"],"content":"黑塞一直是我最喜欢的一位作家之一。他的语言优美，字句之间透露出沉思者的气质。而且，他几乎所有的作品都围绕着“自我”这一主题展开——一个我始终感兴趣，也始终在思索的问题。\n我很喜欢看不同人对同一本书，作家的讨论，所以在上网时，我经常会看到一些探讨黑塞书中女性的评论。有些人认为黑塞在探寻自我的过程中并没有摆脱性别观念的局限，在读他笔下的女性角色的过程中会感到不适。\n我不得不承认，有时，我对此也深感不适。比如，《克林索尔的最后夏天》中，黑塞描述道“但所有女子都爱他，都希望被他爱恋。于是女子间爆发了战火，红发女用敏捷的手抓扯黑发女的头发，把她拉扯到地上，自己也倒地了。女人们互相推搡，每位都在叫、撕、咬，每位都在伤人和被人伤害，大笑、怒吼与痛号相互缠绕，相互纠结，血流得到处都是，丰满肉身被残酷撞击。”\n读到这段后，我就没再看下去了。\n我开始思考：为什么一个在精神层面如此细腻敏感的作家，却在描写女性时让人感到如此陌生？这些女性角色，究竟属于文学的真实，还是只是男人梦中的倒影？\n于是，我开始梳理黑塞作品中的一些女性角色。\n黑塞笔下有一些伟大而光辉的女性形象，比如《德米安》中的艾娃夫人。但\n她们让我感到陌生，仿佛脱离了‘人’的范畴。回到我刚刚描述的艾娃夫人，她在辛克莱（主角）眼中像 “散发着母性的光辉、严厉以及激情。她美丽迷人、无可匹敌”。对于辛克莱的想法，梦中的思考，她会倾听并给出建议，她既是他母亲般的引导者，也是他欲望的投射对象，带有某种神性的梦幻色彩。在悉达多眼中，卡玛拉是悉达多人生的‘世俗阶段’，她教会他了情欲，爱情。她聪慧，美丽，但她在完成任务后就离开，让悉达多继续前行。《在轮下》里，艾玛也如同汉斯的‘老师’，她给他带来了爱恋的愉悦，也让他体会到了被背叛的心痛感。 她们仿佛只是工具，为主角带来了启发与成长的契机，却本身十分扁平。她们似乎只能给主角带来男女关系方面的见解，或者如同母亲般给他们带来温暖的怀抱。我感到不适，是因为我无法体会到她们成长时的挣扎，痛苦，我看不到卡马拉的探索与自我的发现。\n于是，我在喜欢与质疑之间反复徘徊。\n同时，我们也可以说黑塞并没有考虑到当代的男女性观念。比如，在《德米安》中，辛克莱说过，他认为艾娃夫人是 “有时，我觉得吸引我的并非她本人，而是我内心中的一个意象，其唯一目的就是引领我探究内心深处。她说的话很多时候都像是我潜意识中那些问题的答复。”对 …","date":1750464000,"dir":"post\\黑塞笔下的女人都活在男人的梦里\\","expirydate":-62135596800,"fuzzywordcount":1700,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1750464000,"objectID":"070ba90fffbc242440fddcc476fe4eda","permalink":"https://mlswebsite.github.io/post/%E9%BB%91%E5%A1%9E%E7%AC%94%E4%B8%8B%E7%9A%84%E5%A5%B3%E4%BA%BA%E9%83%BD%E6%B4%BB%E5%9C%A8%E7%94%B7%E4%BA%BA%E7%9A%84%E6%A2%A6%E9%87%8C/","publishdate":"2025-06-21T00:00:00Z","readingtime":4,"relpermalink":"/post/%E9%BB%91%E5%A1%9E%E7%AC%94%E4%B8%8B%E7%9A%84%E5%A5%B3%E4%BA%BA%E9%83%BD%E6%B4%BB%E5%9C%A8%E7%94%B7%E4%BA%BA%E7%9A%84%E6%A2%A6%E9%87%8C/","section":"post","tags":["Book Review"],"title":"黑塞笔下的女人，都活在男人的梦里？（Hesse's Female Characters）","type":"post","url":"/post/%E9%BB%91%E5%A1%9E%E7%AC%94%E4%B8%8B%E7%9A%84%E5%A5%B3%E4%BA%BA%E9%83%BD%E6%B4%BB%E5%9C%A8%E7%94%B7%E4%BA%BA%E7%9A%84%E6%A2%A6%E9%87%8C/","weight":0,"wordcount":1615},{"author":null,"categories":["Reading Writing"],"content":"最开始读过黑塞的德米安，感觉很有意思，又开始读起了他的荒原狼。感觉有点难，所以我又回到了他写的比较容易的书，在轮下中。 在表达我的感受前，我还是想先说一下黑塞。我很喜欢黑塞的书，虽然读完需要反复品味，但他的文笔优美，他的想法也很令人深思。我读了两遍德米安，和读完在轮下后一样，感觉每次都多少会有一些新的感悟。\n在轮下并不是一篇很长的小说，我大概断断续续地花了3个小时不到读完了这本书。黑塞主要围绕了一个少年，汉斯，和他在他的家乡，神学院中发生的事情。汉斯在学习过程中结识了叛逆的赫尔曼，在过程中逐渐抑郁，回到了家乡。汉斯像是一个天才，他努力，上进，在州试中以优越的第二名的成绩考进了神学院。在神学院初期，他很孤独，经常一个人。他认识到了很多人，其中之一就是赫尔曼。他热烈，感性，渴望自由，并看不起汉斯这种一生好好学习，费心费力，最后为政府做牛做马的生活。再一次既然巧合下，他们成为了朋友。他们之间经历过磨合，但与赫尔曼的友谊让汉斯感到甘之如饴，并为此放弃了学业。\n在我看来，赫尔曼和汉斯的友谊既奇怪又新奇。赫尔曼学习好，经常会找汉斯去聊天，而汉斯虽然喜欢听他讲话，但这严重的干扰到了他的学习。从此，他的学业一落千丈，在学院中和赫尔曼收到了鄙视。最后，赫尔曼受不了压抑的氛围，逃出了，奔向了自由，只留下了汉斯一个人受着嘲笑和鄙视。所以，我很好奇，赫尔曼到底给汉斯带来了什么？是孤独一人的绝望，身患抑郁症还是备受启发的思想，增进了对自我的探索？我觉得都有。赫尔曼的悄无声息逃离总会让我想起被朋友抛弃的感受-郁闷。老师学生对汉斯的嘲弄，排挤，更深刻的加重了他的病症，使得他最后只好退学。用这些悲痛换取对自我的探索，我实在不清楚是否是值当的。但从赫尔曼那里，我感觉汉斯体会到了自由，美，和一种情愫。\n最深有感触的还是黑塞在书中提到的死亡。当汉斯得了抑郁症，被送回家时，他麻木不仁，有一段时间想过寻死。汉斯从他对死亡的计划中得到了快感，尤其有一句“想着父亲开心的原因竟是他不久以后的死亡”，他带着讽刺的快感想着。有时候很抑郁，崩溃的时候想过说以死去寻求/换取注意，其他人的一种悔恨，在我看来，是一件非常愚蠢的事情（但是我感觉这种想法对我来说挺常见的）。书中，汉斯在神学院中也见证过死亡-有一些青年处于青春期的烦恼，找出了一种快捷的道路去结束这一切-自杀。死亡是一件很沉重的话题，但是赴死太容易了。轻轻一扣动板 …","date":1742515200,"dir":"post\\在轮下\\","expirydate":-62135596800,"fuzzywordcount":1400,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1742515200,"objectID":"4d02540b7114067c632f299dc4b97a48","permalink":"https://mlswebsite.github.io/post/%E5%9C%A8%E8%BD%AE%E4%B8%8B/","publishdate":"2025-03-21T00:00:00Z","readingtime":3,"relpermalink":"/post/%E5%9C%A8%E8%BD%AE%E4%B8%8B/","section":"post","tags":["Book Review"],"title":"在轮下 （Unterm Rad） ","type":"post","url":"/post/%E5%9C%A8%E8%BD%AE%E4%B8%8B/","weight":0,"wordcount":1323},{"author":null,"categories":["Reading Writing"],"content":"这本书讲述了主人公，杨飞死后的几天的经历。他的灵魂似乎没死，因为在死后他立马就被叫去火化了。在要火化的这几天中，他遇到了他的前妻，李青，朋友，鼠妹，和他的父亲。\n我认为这本书是比较值得一看的，因为他给了我们对于死亡的全新看法。余华书中的事件反映了他出版这本书近几年的新闻。读完我真的感到了深深的讽刺，也不禁悲叹于部分人民的经历（真是麻绳专挑细处断），真是苦了一生。\n当杨飞死后，他因没钱没有办法买墓，没办法被安葬。他向前走去，开始回忆起了他的一生。他想起了他与李青的婚姻（我个人不太喜欢这一部分，感觉很写的仓促，结婚理由，离婚理由也很离谱-可能是我不懂爱情吧），想起了他与他的家人（他的父亲，将他视为自己孩子的“母亲”。我认为这一部分写的很好，非常的感人-杨飞不是亲生的，是捡的，但杨金彪-他的父亲-对他不离不弃。他为他拒绝了爱情，虽然在杨飞四岁时抛弃了他，但后面的那句话“爸爸你来了，你终于来了”真的令人落泪）。在路上，他终于走到了死无葬身之地。那里绿草如茵，树木郁郁葱葱，有些人成为了白骨，有些人的肉开始腐烂，但所有人都很快乐。他遇到的张警官和李先生正在下棋（他们一个本是罪犯另一个是逮捕的人员，但在这里成为了朋友。我估计他的作用是衬托出死无葬身之地的美妙之处，乌托邦的感觉，但我个人感觉这个转变太离谱了，太不符合逻辑了-原本发誓要杀死对方的仇人突然成了朋友），他遇到了他的干妈，他遇到了鼠妹（我跟人感觉这个部分写的很有感触。鼠妹和他的男朋友很贫穷，但很相爱。事发原因是因为鼠妹想要iphone 6，但发现他男朋友给她买的是盗版的。她试着联系他却没联系上，便伤心欲绝，欲要跳楼。在救她时，她不慎滑倒，摔落。当他的男朋友得知后，他卖肾给她买了一个墓，却因失血过多而死亡。)我最喜欢的描述是当所有人得知鼠妹有了墓后，每个人排着队，捧着水将她清洗干净，给她做寿衣，将她送走。这将死无葬身之地衬托成了无虑无忧的乌托邦，充满美好的意味。这本书充斥着淡淡的忧伤，但同时又排斥人们对死的恐惧。在余华，读过这本书的人的眼里，死无葬身之地反倒成为了一句祝福，一个美好的地方，受了一辈子的苦的人最后的安慰。\n愿你在死无葬身之地安息。\n（当然，有一些不太喜欢这本书，感觉写的比较敷衍-我倒觉得余华写的观点还挺新颖的，故事情节大部分也算是能接受的，可以当作闲书读一读）\n","date":1740960000,"dir":"post\\第七天\\","expirydate":-62135596800,"fuzzywordcount":1000,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1740960000,"objectID":"06358f43b9bcd588ed828cb37088d5a7","permalink":"https://mlswebsite.github.io/post/%E7%AC%AC%E4%B8%83%E5%A4%A9/","publishdate":"2025-03-03T00:00:00Z","readingtime":2,"relpermalink":"/post/%E7%AC%AC%E4%B8%83%E5%A4%A9/","section":"post","tags":["Book Review"],"title":"第七天（The Seventh Day）","type":"post","url":"/post/%E7%AC%AC%E4%B8%83%E5%A4%A9/","weight":0,"wordcount":969},{"author":null,"categories":["research"],"content":"Introduction From the ancient tragedies of Greece to the modern-day downfalls of business tycoons and political leaders, the concept of hubris has served as a cautionary tale about the perils of unchecked power. The theme hubris was already apparent in Greek tragedies, where it mostly meant disrespecting the gods by not crediting ones’ success or fortune to the gods (Marquez, 2015), often leading to nemesis (divine retribution) and ate (ruin). The meaning of hubris has then evolved into excessive arrogance and over-confidence that leads to self-destruction (Marquez, 2015).\nOwen coined the term hubris syndrome to describe how power can distort judgement and behavior, mostly evident in political leaders (2008). As it isn’t a diagnostic category of mental illness, Selten points out that the term still needs further validation since it’s not included in classification systems (2023), but the phenomena it describes is timeless. This syndrome can be observed in literary characters such as …","date":1736467200,"dir":"post\\hubristic-syndrome\\","expirydate":-62135596800,"fuzzywordcount":5400,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1736467200,"objectID":"e49a441a124266d9fb2e10a41bf4ada0","permalink":"https://mlswebsite.github.io/post/hubristic-syndrome/","publishdate":"2025-01-10T00:00:00Z","readingtime":26,"relpermalink":"/post/hubristic-syndrome/","section":"post","tags":["AP"],"title":"Hubristic syndrome Assessing its literary applications through The Great Gatsby and Agamemnon","type":"post","url":"/post/hubristic-syndrome/","weight":0,"wordcount":5368},{"author":null,"categories":["Reading Writing"],"content":"I’ve recently read Babel by R. F. Kuang, an amazing book. What I really loved was character development, the themes Kuang discussed, and how deeply the story resonates with me. At the heart of the novel is Robin, a Chinese student who is ‘adopted’ by Professor Lovell and sent to study translation at Oxford, in the institution known as Babel, during the 19th century. As Robin navigates life in a colonial world, he faces deep identity struggles.\nWhat I remembered the most was when Robin and his friends discovered that the Britain people were sending Opium into China and using it to trade for silver. This is a topic I was already familiar with from my history lessons, so reading about it in this context felt natural to me. The historical backdrop added layers of depth to the narrative, making Robin’s journey feel urgent and real.\nThe themes of resistance and powerlessness in the face of systemic oppression were especially poignant. Robin and his friends’ efforts feel futile against the …","date":1733097600,"dir":"post\\Babel读后感\\","expirydate":-62135596800,"fuzzywordcount":500,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1733097600,"objectID":"1730be3640bfbffe42605f8c1fba8090","permalink":"https://mlswebsite.github.io/post/babel%E8%AF%BB%E5%90%8E%E6%84%9F/","publishdate":"2024-12-02T00:00:00Z","readingtime":1,"relpermalink":"/post/babel%E8%AF%BB%E5%90%8E%E6%84%9F/","section":"post","tags":["Book Review"],"title":"Babel读后感","type":"post","url":"/post/babel%E8%AF%BB%E5%90%8E%E6%84%9F/","weight":0,"wordcount":423},{"author":null,"categories":["Academics"],"content":" ","date":1732406400,"dir":"post\\macroeconomics-ASAD\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1732406400,"objectID":"97a6ab967b2f4d586302ddd2847248b5","permalink":"https://mlswebsite.github.io/post/macroeconomics-asad/","publishdate":"2024-11-24T00:00:00Z","readingtime":0,"relpermalink":"/post/macroeconomics-asad/","section":"post","tags":null,"title":"macroeconomics ASAD","type":"post","url":"/post/macroeconomics-asad/","weight":0,"wordcount":0},{"author":null,"categories":["Hobbies"],"content":" ","date":1730419200,"dir":"post\\2024.11研学vlog\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1730419200,"objectID":"f7f6831cd697214ec81d1e26fefb778d","permalink":"https://mlswebsite.github.io/post/2024.11%E7%A0%94%E5%AD%A6vlog/","publishdate":"2024-11-01T00:00:00Z","readingtime":0,"relpermalink":"/post/2024.11%E7%A0%94%E5%AD%A6vlog/","section":"post","tags":["vlog"],"title":"2024.11Vlog-AnHui","type":"post","url":"/post/2024.11%E7%A0%94%E5%AD%A6vlog/","weight":0,"wordcount":0},{"author":null,"categories":["Hobbies"],"content":" ","date":1727740800,"dir":"post\\2024总结vlog\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1727740800,"objectID":"e7d80d706cdf67a35c0f205cfb293e05","permalink":"https://mlswebsite.github.io/post/2024%E6%80%BB%E7%BB%93vlog/","publishdate":"2024-10-01T00:00:00Z","readingtime":0,"relpermalink":"/post/2024%E6%80%BB%E7%BB%93vlog/","section":"post","tags":["vlog"],"title":"2024Vlog-School","type":"post","url":"/post/2024%E6%80%BB%E7%BB%93vlog/","weight":0,"wordcount":0},{"author":null,"categories":["Hobbies"],"content":" ","date":1725148800,"dir":"post\\2024.9研学vlog\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1725148800,"objectID":"436bf65ce45abad77aa914d220360610","permalink":"https://mlswebsite.github.io/post/2024.9%E7%A0%94%E5%AD%A6vlog/","publishdate":"2024-09-01T00:00:00Z","readingtime":0,"relpermalink":"/post/2024.9%E7%A0%94%E5%AD%A6vlog/","section":"post","tags":["vlog"],"title":"2024.9Vlog-NYC","type":"post","url":"/post/2024.9%E7%A0%94%E5%AD%A6vlog/","weight":0,"wordcount":0},{"author":null,"categories":["Extracurriculars"],"content":" ","date":1725148800,"dir":"post\\activities\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1725148800,"objectID":"0efa818e9eb835de68aa9f7cb3019a71","permalink":"https://mlswebsite.github.io/post/activities/","publishdate":"2024-09-01T00:00:00Z","readingtime":0,"relpermalink":"/post/activities/","section":"post","tags":null,"title":"Activites-Symposium,Feminism","type":"post","url":"/post/activities/","weight":0,"wordcount":0},{"author":null,"categories":["Reading Writing"],"content":"Screams.\nBlood curling screams. Blood that runs like a river. Flesh molded together. Tangled and scattered limbs. Achilles stood in front of him. The head of the spear flew close to him. Everything seemed to happen in slow motion. Then it was pain.\nCrucifying pain.\nThe bronze dagger seemed to pierce through frozen time as it inched towards Hector’s abdominal. It burst right through his sides, and heat seemed to spread towards his whole body. He looked down and thought he’d seen red run up towards him. His eyes slowly closed as the ground rushed to greet him. Is this how it’s supposed to end? The hero, defender of Troy, lay slack on the grounds, as he watched the Greek trample down his home.\nThe next time Hector opened his eyes, he saw white. Am I dead? That thought lingered in his head like an echo. Holographic words appeared in the air, somewhat like on a screen.\nStart game?\n“Wha-”\nBelow was a button with the letters enter on it. What’s this all about? Hector thought. No time to …","date":1723420800,"dir":"post\\final-project\\","expirydate":-62135596800,"fuzzywordcount":3000,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1723420800,"objectID":"dbef8819038e5ade40cb259b48af15b6","permalink":"https://mlswebsite.github.io/post/final-project/","publishdate":"2024-08-12T00:00:00Z","readingtime":14,"relpermalink":"/post/final-project/","section":"post","tags":["Writings"],"title":"Final Project","type":"post","url":"/post/final-project/","weight":0,"wordcount":2913},{"author":null,"categories":["research"],"content":"Abstract This study investigates the extent to which loss aversion varies across age and gender in China. Employing an online, survey-based method, this study uses econometric approaches (regression models and the utility function in stata) and examines Chinese people of all ages and genders to assess loss aversion through mixed lottery questions. The findings are inconsistent with the hypothesis, revealing that gender and age aren’t significantly related to loss aversion. There seemed to be no significant differences between women and men, although men are a bit more loss-averse than women. Older people are found to be more loss- averse than younger people. These results contribute to the understanding of loss aversion in a cultural context and provide new insights into gender differences. Questions and research topics are proposed for further understanding and further research.\nKeywords ： Loss aversion, risk, gender, age, China, behavioral economics\n1. Introduction and Literature …","date":1722643200,"dir":"post\\attitude-towards-loss-aversion\\","expirydate":-62135596800,"fuzzywordcount":3800,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1722643200,"objectID":"30ae2abcdd1d3192fc98f9bf9b7864d5","permalink":"https://mlswebsite.github.io/post/attitude-towards-loss-aversion/","publishdate":"2024-08-03T00:00:00Z","readingtime":18,"relpermalink":"/post/attitude-towards-loss-aversion/","section":"post","tags":["behavioral economics"],"title":"Attitude Towards Loss Aversion: The Differences Across Age and Gender in China","type":"post","url":"/post/attitude-towards-loss-aversion/","weight":0,"wordcount":3729},{"author":null,"categories":["Extracurriculars"],"content":"CHARACTERS ALEXANDER HAMILTON, the first-ever Secretary of the United States Treasury, is the musical’s protagonist. MOTHER, the mother of Hamilton. GEORGE WASHINGTON, the mentor of Hamilton. BURR, the friend and the narrator of Hamilton. ELIZA, wife of Hamilton. JEFFERSON, a rival of Hamilton with opposing views. ENSEMBLE ACT ONE: YOUTH Time:\nScene 1 Introduction, several people recite:\nPREVIOUS ANCESTOR: (standing in the middle of the stage) How does a bastard, orphan, son of a whore and a Scotsman, dropped in the middle of a forgotten Spot in the Caribbean by providence, impoverished, in squalor Grow up to be a hero and a scholar? (rise arms, move to the right)\nPREVIOUS ANGELICA: The ten-dollar Founding Father without a father Got a lot farther by working a lot harder By being a lot smarter By being a self-starter By fourteen, they placed him in charge of a trading charter (move to the left)\nPREVIOUS MADISON: And every day while slaves were being slaughtered and carted Away across …","date":1717027200,"dir":"post\\hamiltototon-1\\","expirydate":-62135596800,"fuzzywordcount":3100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1717027200,"objectID":"582ee20c2d03654a6c0569b32dfeba8d","permalink":"https://mlswebsite.github.io/post/hamiltototon-1/","publishdate":"2024-05-30T00:00:00Z","readingtime":7,"relpermalink":"/post/hamiltototon-1/","section":"post","tags":["Drama"],"title":"Hamilton","type":"post","url":"/post/hamiltototon-1/","weight":0,"wordcount":3009},{"author":null,"categories":["Extracurriculars"],"content":"Butterflies. What is the first thing that comes to mind when you hear it? It could be the butterfly fluttering in the meadow. But for me, it is the butterflies flying in my stomach. So now you might understand why this x-ray picture with butterflies is doing here. This, quite literally, is just having butterflies in your stomach. So why is it here?\nLet me just begin with telling you what having ‘butterflies in your stomach’ means. This describes the nervous energy in your belly before or during situations where you might feel anxious or excited. I hate this feeling, but you see me standing here, which means I have caught some of them (grabs some of it).\nMy middle school speech competition was still carved in my mind. I wrote my draft and learnt it by heart. While drawing the lot deciding who would go first, I came in second. Standing on the stage, looking at the referees while the coloured lights shone on my face, I could only hear my pounding heart and my brain who ushered me to say …","date":1716681600,"dir":"post\\catching-butterflies\\","expirydate":-62135596800,"fuzzywordcount":700,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1716681600,"objectID":"6a805850803ab9d6c85d6f1c3a15c9a1","permalink":"https://mlswebsite.github.io/post/catching-butterflies/","publishdate":"2024-05-26T00:00:00Z","readingtime":4,"relpermalink":"/post/catching-butterflies/","section":"post","tags":["Speech drafts"],"title":"Catching Butterflies","type":"post","url":"/post/catching-butterflies/","weight":0,"wordcount":698},{"author":null,"categories":["Reading Writing"],"content":" \u0026amp;ldquo;In the moment when I truly understand my enemy, understand him well enough to defeat him, then in that very moment I also love him. I think it\u0026amp;rsquo;s impossible to really understand somebody, what they want, what they believe, and not love them the way they love themselves.\u0026amp;rdquo;\nWhile I was scrolling through movies, I came across Ender’s game. I haven’t read the book before, so my reviews are only on the movie and some comments and reviews others had on the book. The movie was about people training an army used to fight the Formics (sort of like ants), and Ender was the main character who’s destined to lead the team into winning the war. Personally, I believe that it was a good movie, although there were parts that I was confused with or could be better.\nThe quote at the start of the movie provided me a new perspective on our relationship with others. When you fight your enemy, you do everything to understand them in order to win them. I guess that’s why people say the …","date":1716508800,"dir":"post\\ender's-Game-movie-review\\","expirydate":-62135596800,"fuzzywordcount":800,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1716508800,"objectID":"0e20bc123db28d53b8135630e182bfc4","permalink":"https://mlswebsite.github.io/post/enders-game-movie-review/","publishdate":"2024-05-24T00:00:00Z","readingtime":4,"relpermalink":"/post/enders-game-movie-review/","section":"post","tags":["Film Review"],"title":"Ender’s Game movie review","type":"post","url":"/post/enders-game-movie-review/","weight":0,"wordcount":759},{"author":null,"categories":["Extracurriculars"],"content":"I’ve heard a lot of unique topics, so I’m going to start with something common \u0026amp;ndash; books. No matter text books we use for class, books we read outside of school for research, novels for relaxing… Books are woven into our lives.\nDo you remember the first time you read a book? I couldn’t. But that feeling was something I’d always remember. It felt as if we had an immediate bond, and I couldn’t take my eyes off the intricate and fancy pictures. From the soft, fabricated touch of my first book to the scratchy paper and smooth cover of my recent books, I loved reading. Books have been my companions on adventures through time and space, making it a friend worthy of love and time.\nMy fascination with books was at its peak during elementary school, when I started out with chapter books containing all sorts of fantastical journeys. Just like what Emily Dickinson said, “There is no Frigate like a Book; To take us Lands away”. Reading the books, I’ve solved mysteries alongside Sherlock, …","date":1716422400,"dir":"post\\beauty-of-books\\","expirydate":-62135596800,"fuzzywordcount":1000,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1716422400,"objectID":"793103c5820eb0179a10d1369ae1d361","permalink":"https://mlswebsite.github.io/post/beauty-of-books/","publishdate":"2024-05-23T00:00:00Z","readingtime":5,"relpermalink":"/post/beauty-of-books/","section":"post","tags":["Speech drafts"],"title":"Beauty of Books","type":"post","url":"/post/beauty-of-books/","weight":0,"wordcount":928},{"author":null,"categories":["Extracurriculars"],"content":"Today I’m going to start with something common in our lives—books. I don’t know if you could remember properly the first time when you started reading a book. I couldn’t. But that feeling was something I’d always remember. It felt as if we had an immediate bond, and I couldn’t take my eyes off the intricate and fancy pictures. From the soft, fabricated touch of my first book to the scratchy paper and smooth cover of my recent books, I loved reading. I don’t understand passion or love that clearly, but books have been my companions on adventures through time and space, making it a friend worthy of love and time.\nMy fascination with books was at its peak during elementary school, when I started out with chapter books containing all sorts of fantastical journeys. Reading the books, I’ve solved mysteries alongside Sherlock, Poirot, Drew; travelled to fantastical places with Alex and Connor, Harry and Ron, and Katniss; experienced farm life as a blind person, sought out treasure and been …","date":1716163200,"dir":"post\\line-of-passion-24.5.20\\","expirydate":-62135596800,"fuzzywordcount":800,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1716163200,"objectID":"c5af9ccaf6f5d65def2528d03937b122","permalink":"https://mlswebsite.github.io/post/line-of-passion-24.5.20/","publishdate":"2024-05-20T00:00:00Z","readingtime":4,"relpermalink":"/post/line-of-passion-24.5.20/","section":"post","tags":["Speech drafts"],"title":"Line of passion","type":"post","url":"/post/line-of-passion-24.5.20/","weight":0,"wordcount":753},{"author":null,"categories":["Academics"],"content":"1. Abstract During the long river of human history, humans and pets are inseparable. Pets are treasured due to the joy they’ve brought owners and the companionship it brings, cre- ating loving memories. The pet market has risen in the few years, especially during the COVID, when the number of pet owners surged. At the same time, however, more and more pets are getting abandoned, ending up stray and overcrowding the shelters, creat- ing a big burden. People have long been confused of who’s suitable for raising pets, and concerns have been increasing everywhere. To handle this situation, this article will ex- plore a decision evaluating model that help determine what households are suitable for owning a pet and forecasts future pet ownership.\nIn question one, the research team identified the subjective and objective factors, which are age, time commitment, annual salary, education level and level of demand that deter- mines whether a household is suitable for owning a cat. The team first …","date":1710115200,"dir":"post\\IMMC24397795\\","expirydate":-62135596800,"fuzzywordcount":5200,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1710115200,"objectID":"373b09b35dd3c0ecc50a67fea2f23778","permalink":"https://mlswebsite.github.io/post/immc24397795/","publishdate":"2024-03-11T00:00:00Z","readingtime":25,"relpermalink":"/post/immc24397795/","section":"post","tags":["IMMC competition"],"title":"IMMC International 2024: Assessing Family Pet Ownership Based on Multi-Model Correlation Analysis","type":"post","url":"/post/immc24397795/","weight":0,"wordcount":5154},{"author":null,"categories":["Reading Writing"],"content":"What is life? Perhaps it\u0026amp;rsquo;s a long road full of uncertainties and dwindling trails; it could be a vast ocean, waiting for you to venture far into the beyond; or it could be a box. A box filled with surprises. The Seville on Roxy is literally like a box. A box squished with people living their everyday lives. The book gives readers a peek at the lives of residents in the building. Connor, who owns a gold fish named Ian, was cheating on Katie with Faye and Deb. After doing so, he realized that his only love was Katie, but it was too late. Katie found out. Devastated, she left and they broke up. Petunia Delilah, on the other hand, is about to give birth to a baby. But there’s nobody home and her phone is out of battery. Meanwhile, Claire, staying her clean home and never leaving, had just lost her job. Herman, a boy is dealing with the fact that his only relative, grandpa passed away. Passed out on the hallway, he was found by Delilah searching for help. Claire helps by calling 911, …","date":1707696000,"dir":"post\\fishbowl\\","expirydate":-62135596800,"fuzzywordcount":600,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1707696000,"objectID":"33ae699b197ba72be3c2cc751c16a628","permalink":"https://mlswebsite.github.io/post/fishbowl/","publishdate":"2024-02-12T00:00:00Z","readingtime":3,"relpermalink":"/post/fishbowl/","section":"post","tags":["Book Review"],"title":"Fishbowl","type":"post","url":"/post/fishbowl/","weight":0,"wordcount":585},{"author":null,"categories":["Reading Writing"],"content":"故事的开始，蛤蟆先生抑郁了。他开始酗酒，失眠，变得十分邋遢。于是他的朋友们将他带到了心理医生那里去咨询。与苍鹭先生初次相识，他十分抑郁，给他自己的状态打了两分。但通过一次又一次与苍鹭的讨论，蛤蟆感悟到了自己为什么成为了自己的原因，变得活力满满。不仅如此，他也带领着我一起成长，解了到了我们的不同状态，人生中的不同坐标，增强了对自己的认识。\n最初，蛤蟆先生与苍鹭探索了他幼时抑郁的原因。父母给出的无从压力，发泄出口的缺失，以及现在部分朋友对他的态度都令他感到悲伤。此处，苍鹭引入了儿童自我状态 （Child ego state） 的概念（所谓某些人做出的反应与小时候的行动方式，感受相同），又将此分为了自然型儿童和适应型儿童。\n自然型儿童拥有着基本的情绪状态，如快乐、深情、愤怒、悲伤、恐惧。而适应型儿童会顺从，依赖，道歉，适应当下的环境，进入自我保护状态。蛤蟆通过访谈发现他很少发脾气。与其说怒气冲冲的将人骂一顿火撒泼打滚，如图，迫于原生家庭的压力，他可能将此转化为郁闷，怄气，使他一直处于一种弱势群体的状态。\n咨询中，蛤蟆也提到过他的老朋友，獾。獾打算竞选入校董会，并严厉的要求蛤蟆交上辞职信。对此，蛤蟆十分生气，不仅对獾生气，同时也对他自己的不争气的生气。与苍鹭的谈话中，他发现，獾的表现如同他严厉的父母一样，进入了父母自我状态，十分的挑剔，成为了挑剔性父母，通常会很严厉，愤怒，并且爱挑剔对方。同时，苍鹭也提到了蛤蟆的状态-处于父母自我状态下的他，并不会去批判其他人，但会进行自我批判；这也使苍鹭提到了一个游戏-poor little old me，提出了对于游戏的输赢都取决于玩家的看法，提出了蛤蟆可能在‘共谋’，在暗处导致自己的行为向结果偏向。\n最后一个状态，成人自我状态 Adult ego state。苍鹭对蛤蟆说“ 在这个状态下，我们能计划、考虑、决定、行动，我们能理性而合理地行事。处于这个状态时，我们所有的知识和技能都能为自己所用，而不再被脑子里父母过去的声音所驱使，也不会被童年的情绪所围困。相反，我们能思考当下的状况，基于事实来决定要怎么做。” 在大部分人眼中，我相信这个是最佳的状态，但这个状态取决于自己是否能让自己达到这个状态。成长的过程中，我们应该学会为自己的行为负责，与其去买怨别人，不如改变自己。\n从中，苍鹭介绍了两件新的事情：人生坐标与心理游戏。人们的观念其实是从 …","date":1707696000,"dir":"post\\蛤蟆先生去看心理医生\\","expirydate":-62135596800,"fuzzywordcount":1900,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1707696000,"objectID":"ba9b70b3b0e345a2667e5be1a69bbe1f","permalink":"https://mlswebsite.github.io/post/%E8%9B%A4%E8%9F%86%E5%85%88%E7%94%9F%E5%8E%BB%E7%9C%8B%E5%BF%83%E7%90%86%E5%8C%BB%E7%94%9F/","publishdate":"2024-02-12T00:00:00Z","readingtime":4,"relpermalink":"/post/%E8%9B%A4%E8%9F%86%E5%85%88%E7%94%9F%E5%8E%BB%E7%9C%8B%E5%BF%83%E7%90%86%E5%8C%BB%E7%94%9F/","section":"post","tags":["Book Review"],"title":"蛤蟆先生去看心理医生 （Counselling for Toads）","type":"post","url":"/post/%E8%9B%A4%E8%9F%86%E5%85%88%E7%94%9F%E5%8E%BB%E7%9C%8B%E5%BF%83%E7%90%86%E5%8C%BB%E7%94%9F/","weight":0,"wordcount":1810},{"author":null,"categories":["research"],"content":"In a psychological view, self-determination means the result or process of acting under one’s own choice, ‘particularly to behaviours that improves one’s circumstance’ (APA dictionary of psychology, 2018; Merriam-Webster, n.d.). Self-determination is useful in overcoming fears, giving humans the courage to achieve more, as did Jerry when going through the tunnel (Lessing, 1957), bringing him growth and maturity. For adolescents, or even young children like Jerry, self-determination could help them make vocational decisions, informed choices, and increase independence (Field, Hoffman, Posch 1997). Increased motivation and satisfaction of three fundamental needs also increases self- determination, helping ones to persevere through challenges. Elouise Cobell presents such characteristic when going against the U.S. government, fighting for the rights of the Blackfoot tribe, bringing justice eventually (Janko, 2013).\nSelf-determination is linked with motivation, which is performed through …","date":1704153600,"dir":"post\\self-determination-theory\\","expirydate":-62135596800,"fuzzywordcount":2600,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1704153600,"objectID":"0c58a030810ceb4712ddcdbf15b0b047","permalink":"https://mlswebsite.github.io/post/self-determination-theory/","publishdate":"2024-01-02T00:00:00Z","readingtime":12,"relpermalink":"/post/self-determination-theory/","section":"post","tags":["AP"],"title":"Self Determination Theory","type":"post","url":"/post/self-determination-theory/","weight":0,"wordcount":2548},{"author":null,"categories":["research"],"content":"Introduction From Dolly the Sheep to Snuppy the Dog, pet cloning is gaining more attention, and the number of people who are considering using this technique to resurrect their pet is climbing. Since commencing operations in 2015, Viagen, a company specializing in pet cloning, has reported an increase in the number of cloning procedures performed. The company has disclosed completing hundreds of procedures to date (Dimitropoulos, 2022). But is this the right thing to do?\nPet cloning has its ups and downs. This article evaluates the value it has in a scientific view. To sum it up, the merits of pet cloning are controversial in the scientific community, with the main points of the dispute being the process\u0026amp;rsquo;s efficiency, the long-term health implications for cloned animals, and reprogramming considerations surrounding the SCNT technology.\nInefficient Process The cloning of animals typically utilizes the SCNT (Somatic cell nuclear transfer) technique . The cloning process starts with …","date":1704067200,"dir":"post\\companion-animal-cloning-from-a-scientific-viewpoint\\","expirydate":-62135596800,"fuzzywordcount":1600,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1704067200,"objectID":"c10c4893f95b146de2a3b1c492428a9b","permalink":"https://mlswebsite.github.io/post/companion-animal-cloning-from-a-scientific-viewpoint/","publishdate":"2024-01-01T00:00:00Z","readingtime":8,"relpermalink":"/post/companion-animal-cloning-from-a-scientific-viewpoint/","section":"post","tags":["AP"],"title":"Companion Animal Cloning from a Scientific Viewpoint","type":"post","url":"/post/companion-animal-cloning-from-a-scientific-viewpoint/","weight":0,"wordcount":1575},{"author":null,"categories":["Extracurriculars"],"content":" ","date":1703116800,"dir":"post\\志愿活动\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1703116800,"objectID":"4ed1eeb25c3e271cc0a2b065e9ab1e51","permalink":"https://mlswebsite.github.io/post/%E5%BF%97%E6%84%BF%E6%B4%BB%E5%8A%A8/","publishdate":"2023-12-21T00:00:00Z","readingtime":0,"relpermalink":"/post/%E5%BF%97%E6%84%BF%E6%B4%BB%E5%8A%A8/","section":"post","tags":["Community Service"],"title":"Community Service","type":"post","url":"/post/%E5%BF%97%E6%84%BF%E6%B4%BB%E5%8A%A8/","weight":0,"wordcount":0},{"author":null,"categories":["Extracurriculars"],"content":" ","date":1703116800,"dir":"post\\hamiltototon-image\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1703116800,"objectID":"143f9969ea6ff44afab3b1ab83e77ac3","permalink":"https://mlswebsite.github.io/post/hamiltototon-image/","publishdate":"2023-12-21T00:00:00Z","readingtime":0,"relpermalink":"/post/hamiltototon-image/","section":"post","tags":["Drama"],"title":"Drama performance","type":"post","url":"/post/hamiltototon-image/","weight":0,"wordcount":0},{"author":null,"categories":["Extracurriculars"],"content":" ","date":1703116800,"dir":"post\\表演\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1703116800,"objectID":"0d9b5a7cf4df99666cde51835f0e805c","permalink":"https://mlswebsite.github.io/post/%E8%A1%A8%E6%BC%94/","publishdate":"2023-12-21T00:00:00Z","readingtime":0,"relpermalink":"/post/%E8%A1%A8%E6%BC%94/","section":"post","tags":["Community Service"],"title":"Flute: performances","type":"post","url":"/post/%E8%A1%A8%E6%BC%94/","weight":0,"wordcount":0},{"author":null,"categories":["Extracurriculars"],"content":" ","date":1703116800,"dir":"post\\演讲\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1703116800,"objectID":"2830e561fa04a1d1b63b40201a7e8511","permalink":"https://mlswebsite.github.io/post/%E6%BC%94%E8%AE%B2/","publishdate":"2023-12-21T00:00:00Z","readingtime":0,"relpermalink":"/post/%E6%BC%94%E8%AE%B2/","section":"post","tags":["Speech drafts"],"title":"Speech","type":"post","url":"/post/%E6%BC%94%E8%AE%B2/","weight":0,"wordcount":0},{"author":null,"categories":["Academics"],"content":"摘要 自古至今，屋顶在人们的生活中不可缺，它不仅起到遮风、挡雨、防晒、保温、隔热的作用，同时还代表着家庭和睦、民生安全，更在历史中象征着权力地位。屋顶所处地区的气候特征影响屋顶屋顶结构，人们的品味、历史的进程，也在潜移默化地作用于屋顶结构样式的演进。不同地区的屋顶样式、曲度、坡度各不相同，每一种屋顶都有其独特的优势，亦存在缺陷。长久以来人们试图找到最适合某一地区的最优屋顶配置，但由于环境、经济、人文的多种因素，此问题很难完美解答。因此，本文根据题目中的三个问题，试图找到不同地区屋顶的最佳配置。\n针对问题一，本文根据雨水从屋檐抛出的最远距离和落雨量的密集区域判断屋顶抵挡暴雨的能力。本文首先列举了典型的 7 种不同类型的屋顶——悬山顶、硬山顶、 庑殿顶等，然后使用catcher pro等软件模拟了其中 4 种屋顶在暴雨来临时的水流抛出落点，最后结合上述流体模型找出最佳的屋顶配置。在此问题中，本建模小组将屋顶形状抽象为其屋檐对应的曲线方程，并根据此方程使用catcher pro和fluent进行数据模拟，得出暴雨水流落点的相关数据。随后利用权重分析的方法得出了能够最好的将雨水‘抛出’的屋顶——坡屋顶。\n针对问题二，本文先确定了要研究的屋顶表征——曲度和倾斜角度，随之又找出了影响表征的因素，包括环境、经济、人文三方面。为了找出具体、准确的数值，本文在数学模型中暂时排除了人文因素，主要关注于环境和经济因素。为了找出普遍优点，本建模小组先找出了五个分布在不同地区的省份的特色房屋建筑，测量出了具体数值并且使用PCA分析法找到了主要的影响因素，比较了该因素与屋顶的相关性。随后，为解决“找到不同地区的最佳屋顶配置”的问题，我们使用了商权法-TOPSIS最 短路径分析法客观地确定评分，再将屋顶坡度以及曲率和纬度的关系式一一带入，找出适用于不同地区的屋顶最优配置。\n本文的创新之处在于第一问的仿真模拟模型和第二问的解题方法。第一问使用了catch up的3D建模并用fluent真实的模拟出了暴雨的具体发生情况，随机出雨滴大小与雨滴分布位置。同时屋顶的建模也还原了最真的的样貌，可以最真实的观察出暴雨时滴落雨滴的抛出距离。第二问中，本建模小组将所有指标与纬度建立了联系，确定了函数关系，使用PCA找到了主要响因素，再将此带入到TOPSIS模型中去客观的确定评分，找出最优配置。\n关键词： 屋顶；屋 …","date":1699401600,"dir":"post\\IMMC24199225\\","expirydate":-62135596800,"fuzzywordcount":7600,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1699401600,"objectID":"34ad7ccf376e3a115d70186f7d33001b","permalink":"https://mlswebsite.github.io/post/immc24199225/","publishdate":"2023-11-08T00:00:00Z","readingtime":16,"relpermalink":"/post/immc24199225/","section":"post","tags":["IMMC competition"],"title":"IMMC First round: 国际赛（中华区）建模大赛（B 题）","type":"post","url":"/post/immc24199225/","weight":0,"wordcount":7549},{"author":null,"categories":["Hobbies"],"content":" ","date":1645142400,"dir":"post\\初二新年vlog\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1645142400,"objectID":"129afb5d170ffa46a57a4bfb47385967","permalink":"https://mlswebsite.github.io/post/%E5%88%9D%E4%BA%8C%E6%96%B0%E5%B9%B4vlog/","publishdate":"2022-02-18T00:00:00Z","readingtime":0,"relpermalink":"/post/%E5%88%9D%E4%BA%8C%E6%96%B0%E5%B9%B4vlog/","section":"post","tags":["vlog"],"title":"2022 New Year Vlog","type":"post","url":"/post/%E5%88%9D%E4%BA%8C%E6%96%B0%E5%B9%B4vlog/","weight":0,"wordcount":0},{"author":null,"categories":["Hobbies"],"content":"![2016.3]\n![2017.7] ","date":1458432000,"dir":"post\\Hobbies-Musicals\u0026Drama\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1458432000,"objectID":"bccf2c8b5e5e5683ac2bcc103298688f","permalink":"https://mlswebsite.github.io/post/hobbies-musicalsdrama/","publishdate":"2016-03-20T00:00:00Z","readingtime":1,"relpermalink":"/post/hobbies-musicalsdrama/","section":"post","tags":["Drama"],"title":"Hobbies: Drama \u0026 Musical","type":"post","url":"/post/hobbies-musicalsdrama/","weight":0,"wordcount":2},{"author":null,"categories":["Hobbies"],"content":"2017.7\n2018.10\n2025.7 ","date":1437436800,"dir":"post\\Hobbies-golf\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1437436800,"objectID":"d0a96e2337fc3d431f53948584c9e005","permalink":"https://mlswebsite.github.io/post/hobbies-golf/","publishdate":"2015-07-21T00:00:00Z","readingtime":1,"relpermalink":"/post/hobbies-golf/","section":"post","tags":null,"title":"Sports- Golf","type":"post","url":"/post/hobbies-golf/","weight":0,"wordcount":3},{"author":null,"categories":null,"content":"关于我 Hi，I\u0026amp;rsquo;m Muqian (Monique) Lyu. I\u0026amp;rsquo;m a student in Beijing Academy, ready to graduate at July, 2026. I\u0026amp;rsquo;m a huge fan of reading, especially fiction- I\u0026amp;rsquo;ve once read over 100 books in a year! I\u0026amp;rsquo;ve been described as sensitive, bubbly, caring, reflective, and a high achiever from my friends. I\u0026amp;rsquo;m always ready to take on a challenge that helps me grow! As you can see in my website, i\u0026amp;rsquo;m a person with diverse interests in psychology, philosophy, literature and economics. In the future, I hope to combine go further on a path that focuses on the intersection of my interests.\n","date":-62135596800,"dir":"about\\","expirydate":-62135596800,"fuzzywordcount":200,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":-62135596800,"objectID":"8576ec274c98b3831668a172fa632d80","permalink":"https://mlswebsite.github.io/about/","publishdate":"0001-01-01T00:00:00Z","readingtime":1,"relpermalink":"/about/","section":"","tags":null,"title":"","type":"page","url":"/about/","weight":0,"wordcount":113},{"author":null,"categories":null,"content":"","date":-62135596800,"dir":"search\\","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":-62135596800,"objectID":"8946788897930c0c0c39fbfcd30ff2e4","permalink":"https://mlswebsite.github.io/search/placeholder/","publishdate":"0001-01-01T00:00:00Z","readingtime":0,"relpermalink":"/search/placeholder/","section":"search","tags":null,"title":"","type":"search","url":"/search/placeholder/","weight":0,"wordcount":0},{"author":null,"categories":null,"content":"","date":-62135596800,"dir":"archive\\","expirydate":-62135596800,"fuzzywordcount":100,"html":"Archive of historical posts.","keywords":null,"kind":"page","lang":"en","lastmod":-62135596800,"objectID":"a06e5ce9eca4c3260843078104889780","permalink":"https://mlswebsite.github.io/archive/","publishdate":"0001-01-01T00:00:00Z","readingtime":0,"relpermalink":"/archive/","section":"","tags":null,"title":"Posts Archive","type":"archive","url":"/archive/","weight":0,"wordcount":0}]